{"data":{"site":{"siteMetadata":{"author":{"name":"Emmanuel Fleurine","contacts":{"twitter":"EmmaFleurine"}},"disqusShortname":"","subtitle":"Software dev thinking","title":"Blog by Emmanuel Fleurine","url":"https://efleurine.me"}},"markdownRemark":{"id":"c5b508ba-835e-5050-b324-a7811448d7ca","html":"<p>This mythic phrase is associated with Newton, one of the greatest minds in the human. Newton gives us the secret of his great vision, which he refers to as the “shoulders of giants”, being able to leverage others works has being essential for Newton. The same is true for everyone today; especially the one working in software development. </p>\n<p><img src=\"/media/open-source-word-cloud.jpg\" alt=\"Open source word cloud\"></p>\n<p>Today, open source is a source of a vast amount of resources that everyone is able to access and also to contribute back. Keeping the circle. The more efficient I am becoming in my work, the more I realize how true Newton was. Our use case is almost never completely unique meaning there is a great percentage of chance that someone has already solved it or started drafting a solution.  And even in the case where we face a particular set of problems, there is a good chance that somewhere someone might also be interested in solving it, thus an opportunity to collaborate and to work together. </p>\n<p>How many generations have stand on the shoulders of Newton? That is the beauty of open source. As you are interacting with others, as you are learning from others, others will also learn from you, they will learn from the questions you ask, they will learn from the answers you give. </p>\n<p>I am not alone; you are not alone. Be my giant, I will be your giant. </p>\n<p>Best,</p>\n<p>Emmanuel Fleurine.</p>","fields":{"slug":"/posts/stand-on-giant-shoulders/","tagSlugs":["/tag/open-source/","/tag/learning/"]},"frontmatter":{"date":"2019-03-12T05:40:14.963Z","description":"If I have seen further than others, it is by standing upon the shoulders of giants. I am not alone; you are not alone. Be my giant, I will be your giant.","tags":["Open source","Learning"],"title":"Stand on giant shoulders"}}},"pageContext":{"slug":"/posts/stand-on-giant-shoulders/"}}